:arrow_double_down:
#+SETUPFILE: /home/hxz/gitdown/org-html-themes/setup/theme-readtheorg-local.setup
#+HTML_HEAD: <style>pre.src{background:#343131;color:white;} </style>

# no default toc at all

#+OPTIONS:d:t p:t todo:nil tags:nil p:2 toc:2 ^:nil _:nil

# only number at level 2
#+OPTIONS: H:3

# can use colors,date,email,.....
#+INCLUDE: "~/gitdown/org-macros/org-macros.setup"

#+COLUMNS: %7TODO(To Do) %40ITEM(TASK) %TAGS(Tags) %6CLOCKSUM(Clock) %8Effort(Effort){:}
#+PROPERTIES: Effort_ALL 0:15 0:30 0:45 1:00 1:30 2:00
#+PROPERTY: Pages 
#+PROPERTIES: Rating_ALL + ++ +++ ++++ +++++
#+SEQ_TODO: NEXT(n/!) TODO(t@/!)  BREAK(b@/!)  :exclamation:(f@/!) SCRATCH(s@/!) Q:(q) | DONE(d@) CANCELLED(c@) MORE(m) 
#+TAGS: zero(0) one(1) two(2) three(3)
#+ARCHIVE: myarchive.org::
#+STARTUP: align

#+AUTHOR:hexinzheng
#+TITLE: Coq Art's 2004

#+LATEX_COMPILER: xelatex
#+LATEX_CLASSOPTIONS: [a4paper]
#+LATEX_HEADER: \usepackage{fontspec}
#+LATEX_HEADER: \usepackage{CJK}
#+LATEX_HEADER: \usepackage{ctex}
#+LATEX_HEADER: \usepackage{geometry}
#+LATEX_HEADER: \usepackage{xcolor}
#+LATEX_HEADER: \usepackage{underscore}
#+LATEX_HEADER: \usepackage{amssymb}
#+LATEX_HEADER: \usepackage[hidelinks]{hyperref}
#+LATEX_HEADER: \usepackage[bibstyle=gb7714-2015,
#+LATEX_HEADER:     citestyle=gb7714-2015,
#+LATEX_HEADER:     backend=biber,
#+LATEX_HEADER:     backref=true,
#+LATEX_HEADER:     seconds=true,
#+LATEX_HEADER:     sorting=none]{biblatex}
#+LATEX_HEADER: \addbibresource{../main.bib}

# 配置仿宋字体
#+LATEX_HEADER: \newCJKfontfamily[fsong]\myfsong{FangSong}
#+LATEX_HEADER: \newCJKfontfamily[fhei]\myheiti{SimHei}
#+LATEX_HEADER: \newCJKfontfamily[fzxiaobiao]\myfzxiaobiao{方正小标宋_GBK}
#+LATEX_HEADER: \newCJKfontfamily[ftimes]\mytimes{Times New Roman}

# 主要字体族
#+LATEX_HEADER: \setCJKmainfont[AutoFakeBold]{SimSun}
#+LATEX_HEADER: \setCJKsansfont[AutoFakeBold]{SimHei}
#+LATEX_HEADER: \setmainfont{Times New Roman}
#+LATEX_HEADER: \setsansfont{Arial}

# 页面配置
#+LATEX_HEADER: \geometry{
* A Brief Overview
  :PROPERTIES:
  :Effort:   2:00:00
  :END:
  :CLOCKLOG:
  CLOCK: [2020-02-20 Thu 17:57]--[2020-02-20 Thu 18:30] =>  0:33
  CLOCK: [2020-02-19 Wed 19:21]--[2020-02-19 Wed 19:37] =>  0:16
  :END:
** Propositions and Proofs
   :CLOCKLOG:
   CLOCK: [2020-02-20 Thu 18:55]--[2020-02-20 Thu 19:13] =>  0:18
   :END:

   | assertion                         | value         |
   |-----------------------------------+---------------|
   | $3\leq 8$                         | True or False |
   | list concatenation is associative | True or False |

   - tactics :: make it easier to construct a proof of a propersition. In many cases, tactics make it possible to construct a proof automatically, but this cannot always be the case. There is a wide variety of available tactics and expert users also have the possibility to add their own tactics (see [[The Tactic Definition Language]] )
   
** Specifications and Certified Programs
   :CLOCKLOG:
   CLOCK: [2020-02-20 Thu 20:57]--[2020-02-20 Thu 21:07] =>  0:10
   CLOCK: [2020-02-20 Thu 19:35]--[2020-02-20 Thu 20:07] =>  0:32
   :END:
   
    - Usage :: Propostion can refer to _types_ and _programs_. /Coq/ type system also make it possible to consider the converse:
#+begin_quote
The type of programm can contain /constraints/ expressed as /proposition/ that must be satisfied by /data/. This is *dependent type* . 
#+end_quote

** A Sorting Example
   :CLOCKLOG:
   CLOCK: [2020-02-20 Thu 21:31]--[2020-02-20 Thu 22:16] =>  0:45
   :END:
   - Question :: How can we specify a sorting program ?
*** A Specification for a Sorting Program
    :CLOCKLOG:
    CLOCK: [2020-02-20 Thu 22:21]--[2020-02-20 Thu 22:30] =>  0:09
    :END:
    
    We have already seen that the /Coq/ type system integrates complex specifications, with which we can constrain the input and output data of programs.
    - Sorting algorithm type :: $\text{Z_sort}$
    - Function :: list Z $\rightarrow$ list Z 

* Inductive Data Types
  :PROPERTIES:
  :Effort:   10:00:00
  :PAGES:    158-208
  :END:
  :CLOCKLOG:
  CLOCK: [2020-02-19 Wed 19:37]--[2020-02-19 Wed 20:30] =>  0:53
  CLOCK: [2020-02-19 Wed 14:53]--[2020-02-19 Wed 17:00] =>  2:07
  CLOCK: [2020-02-18 Tue 20:44]--[2020-02-18 Tue 21:23] =>  0:39
  CLOCK: [2020-02-18 Tue 15:21]--[2020-02-18 Tue 15:36] =>  0:15
  CLOCK: [2020-02-18 Tue 13:10]--[2020-02-18 Tue 14:14] =>  1:04
  CLOCK: [2020-02-18 Tue 10:39]--[2020-02-18 Tue 11:55] =>  1:16
  :END:
  Each inductive type corresponds to a computation structure, based on pattern matching and recursion.
  Question:
  - [ ] What's computation structure ?
  - [ ] What's inductive type ?

